GopalSaraf/Practicals/PSDL/include/proc/pic18f4520.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 0F83h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h
PORTD_PSP0_POSN                          equ 0000h
PORTD_PSP0_POSITION                      equ 0000h
PORTD_PSP0_SIZE                          equ 0001h
PORTD_PSP0_LENGTH                        equ 0001h
PORTD_PSP0_MASK                          equ 0001h
PORTD_PSP1_POSN                          equ 0001h
PORTD_PSP1_POSITION                      equ 0001h
PORTD_PSP1_SIZE                          equ 0001h
PORTD_PSP1_LENGTH                        equ 0001h
PORTD_PSP1_MASK                          equ 0002h
PORTD_PSP2_POSN                          equ 0002h
PORTD_PSP2_POSITION                      equ 0002h
PORTD_PSP2_SIZE                          equ 0001h
PORTD_PSP2_LENGTH                        equ 0001h
PORTD_PSP2_MASK                          equ 0004h
PORTD_PSP3_POSN                          equ 0003h
PORTD_PSP3_POSITION                      equ 0003h
PORTD_PSP3_SIZE                          equ 0001h
PORTD_PSP3_LENGTH                        equ 0001h
PORTD_PSP3_MASK                          equ 0008h
PORTD_PSP4_POSN                          equ 0004h
PORTD_PSP4_POSITION                      equ 0004h
PORTD_PSP4_SIZE                          equ 0001h
PORTD_PSP4_LENGTH                        equ 0001h
PORTD_PSP4_MASK                          equ 0010h
PORTD_PSP5_POSN                          equ 0005h
PORTD_PSP5_POSITION                      equ 0005h
PORTD_PSP5_SIZE                          equ 0001h
PORTD_PSP5_LENGTH                        equ 0001h
PORTD_PSP5_MASK                          equ 0020h
PORTD_PSP6_POSN                          equ 0006h
PORTD_PSP6_POSITION                      equ 0006h
PORTD_PSP6_SIZE                          equ 0001h
PORTD_PSP6_LENGTH                        equ 0001h
PORTD_PSP6_MASK                          equ 0040h
PORTD_PSP7_POSN                          equ 0007h
PORTD_PSP7_POSITION                      equ 0007h
PORTD_PSP7_SIZE                          equ 0001h
PORTD_PSP7_LENGTH                        equ 0001h
PORTD_PSP7_MASK                          equ 0080h
PORTD_P1B_POSN                           equ 0005h
PORTD_P1B_POSITION                       equ 0005h
PORTD_P1B_SIZE                           equ 0001h
PORTD_P1B_LENGTH                         equ 0001h
PORTD_P1B_MASK                           equ 0020h
PORTD_P1C_POSN                           equ 0006h
PORTD_P1C_POSITION                       equ 0006h
PORTD_P1C_SIZE                           equ 0001h
PORTD_P1C_LENGTH                         equ 0001h
PORTD_P1C_MASK                           equ 0040h
PORTD_P1D_POSN                           equ 0007h
PORTD_P1D_POSITION                       equ 0007h
PORTD_P1D_SIZE                           equ 0001h
PORTD_P1D_LENGTH                         equ 0001h
PORTD_P1D_MASK                           equ 0080h
PORTD_SS2_POSN                           equ 0007h
PORTD_SS2_POSITION                       equ 0007h
PORTD_SS2_SIZE                           equ 0001h
PORTD_SS2_LENGTH                         equ 0001h
PORTD_SS2_MASK                           equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0F84h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_RD_POSN                            equ 0000h
PORTE_RD_POSITION                        equ 0000h
PORTE_RD_SIZE                            equ 0001h
PORTE_RD_LENGTH                          equ 0001h
PORTE_RD_MASK                            equ 0001h
PORTE_WR_POSN                            equ 0001h
PORTE_WR_POSITION                        equ 0001h
PORTE_WR_SIZE                            equ 0001h
PORTE_WR_LENGTH                          equ 0001h
PORTE_WR_MASK                            equ 0002h
PORTE_CS_POSN                            equ 0002h
PORTE_CS_POSITION                        equ 0002h
PORTE_CS_SIZE                            equ 0001h
PORTE_CS_LENGTH                          equ 0001h
PORTE_CS_MASK                            equ 0004h
PORTE_MCLR_POSN                          equ 0003h
PORTE_MCLR_POSITION                      equ 0003h
PORTE_MCLR_SIZE                          equ 0001h
PORTE_MCLR_LENGTH                        equ 0001h
PORTE_MCLR_MASK                          equ 0008h
PORTE_NOT_RD_POSN                        equ 0000h
PORTE_NOT_RD_POSITION                    equ 0000h
PORTE_NOT_RD_SIZE                        equ 0001h
PORTE_NOT_RD_LENGTH                      equ 0001h
PORTE_NOT_RD_MASK                        equ 0001h
PORTE_NOT_WR_POSN                        equ 0001h
PORTE_NOT_WR_POSITION                    equ 0001h
PORTE_NOT_WR_SIZE                        equ 0001h
PORTE_NOT_WR_LENGTH                      equ 0001h
PORTE_NOT_WR_MASK                        equ 0002h
PORTE_NOT_CS_POSN                        equ 0002h
PORTE_NOT_CS_POSITION                    equ 0002h
PORTE_NOT_CS_SIZE                        equ 0001h
PORTE_NOT_CS_LENGTH                      equ 0001h
PORTE_NOT_CS_MASK                        equ 0004h
PORTE_NOT_MCLR_POSN                      equ 0003h
PORTE_NOT_MCLR_POSITION                  equ 0003h
PORTE_NOT_MCLR_SIZE                      equ 0001h
PORTE_NOT_MCLR_LENGTH                    equ 0001h
PORTE_NOT_MCLR_MASK                      equ 0008h
PORTE_nRD_POSN                           equ 0000h
PORTE_nRD_POSITION                       equ 0000h
PORTE_nRD_SIZE                           equ 0001h
PORTE_nRD_LENGTH                         equ 0001h
PORTE_nRD_MASK                           equ 0001h
PORTE_nWR_POSN                           equ 0001h
PORTE_nWR_POSITION                       equ 0001h
PORTE_nWR_SIZE                           equ 0001h
PORTE_nWR_LENGTH                         equ 0001h
PORTE_nWR_MASK                           equ 0002h
PORTE_nCS_POSN                           equ 0002h
PORTE_nCS_POSITION                       equ 0002h
PORTE_nCS_SIZE                           equ 0001h
PORTE_nCS_LENGTH                         equ 0001h
PORTE_nCS_MASK                           equ 0004h
PORTE_nMCLR_POSN                         equ 0003h
PORTE_nMCLR_POSITION                     equ 0003h
PORTE_nMCLR_SIZE                         equ 0001h
PORTE_nMCLR_LENGTH                       equ 0001h
PORTE_nMCLR_MASK                         equ 0008h
PORTE_AN5_POSN                           equ 0000h
PORTE_AN5_POSITION                       equ 0000h
PORTE_AN5_SIZE                           equ 0001h
PORTE_AN5_LENGTH                         equ 0001h
PORTE_AN5_MASK                           equ 0001h
PORTE_AN6_POSN                           equ 0001h
PORTE_AN6_POSITION                       equ 0001h
PORTE_AN6_SIZE                           equ 0001h
PORTE_AN6_LENGTH                         equ 0001h
PORTE_AN6_MASK                           equ 0002h
PORTE_AN7_POSN                           equ 0002h
PORTE_AN7_POSITION                       equ 0002h
PORTE_AN7_SIZE                           equ 0001h
PORTE_AN7_LENGTH                         equ 0001h
PORTE_AN7_MASK                           equ 0004h
PORTE_VPP_POSN                           equ 0003h
PORTE_VPP_POSITION                       equ 0003h
PORTE_VPP_SIZE                           equ 0001h
PORTE_VPP_LENGTH                         equ 0001h
PORTE_VPP_MASK                           equ 0008h
PORTE_PD2_POSN                           equ 0000h
PORTE_PD2_POSITION                       equ 0000h
PORTE_PD2_SIZE                           equ 0001h
PORTE_PD2_LENGTH                         equ 0001h
PORTE_PD2_MASK                           equ 0001h
PORTE_PC2_POSN                           equ 0001h
PORTE_PC2_POSITION                       equ 0001h
PORTE_PC2_SIZE                           equ 0001h
PORTE_PC2_LENGTH                         equ 0001h
PORTE_PC2_MASK                           equ 0002h
PORTE_CCP10_POSN                         equ 0002h
PORTE_CCP10_POSITION                     equ 0002h
PORTE_CCP10_SIZE                         equ 0001h
PORTE_CCP10_LENGTH                       equ 0001h
PORTE_CCP10_MASK                         equ 0004h
PORTE_CCP9E_POSN                         equ 0003h
PORTE_CCP9E_POSITION                     equ 0003h
PORTE_CCP9E_SIZE                         equ 0001h
PORTE_CCP9E_LENGTH                       equ 0001h
PORTE_CCP9E_MASK                         equ 0008h
PORTE_RDE_POSN                           equ 0000h
PORTE_RDE_POSITION                       equ 0000h
PORTE_RDE_SIZE                           equ 0001h
PORTE_RDE_LENGTH                         equ 0001h
PORTE_RDE_MASK                           equ 0001h
PORTE_WRE_POSN                           equ 0001h
PORTE_WRE_POSITION                       equ 0001h
PORTE_WRE_SIZE                           equ 0001h
PORTE_WRE_LENGTH                         equ 0001h
PORTE_WRE_MASK                           equ 0002h
PORTE_PB2_POSN                           equ 0002h
PORTE_PB2_POSITION                       equ 0002h
PORTE_PB2_SIZE                           equ 0001h
PORTE_PB2_LENGTH                         equ 0001h
PORTE_PB2_MASK                           equ 0004h
PORTE_PC3E_POSN                          equ 0003h
PORTE_PC3E_POSITION                      equ 0003h
PORTE_PC3E_SIZE                          equ 0001h
PORTE_PC3E_LENGTH                        equ 0001h
PORTE_PC3E_MASK                          equ 0008h

